In [1]:
import csv
import re

import numpy as np
import pandas as pd

In [34]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
    columns=[["Ohio", "Ohio", "Colorado"], ["Green", "Red", "Green"]],
)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "color"]

In [14]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [36]:
frame.index.names

FrozenList([None, None])

In [15]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [16]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
frame.index.levels

FrozenList([['a', 'b'], [1, 2]])

In [18]:
frame.index.levels[0]

Index(['a', 'b'], dtype='object', name='key1')

In [24]:
frame.swaplevel(0, 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [37]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [42]:
frame["Colorado"]

     Green
a 1      2
  2      5
b 1      8
  2     11

In [63]:
frame.loc[(slice(None), 2),"Colorado"]

     Green
a 2      5
b 2     11

In [66]:
frame.xs(2, level=1, drop_level=False)["Colorado"]

     Green
a 2      5
b 2     11

In [2]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [3]:
s1

a    0
b    1
dtype: Int64

In [4]:
s2

c    2
d    3
e    4
dtype: Int64

In [5]:
s3

f    5
g    6
dtype: Int64

In [8]:
pd.concat([s1, s1, s3], keys=["one", "two", "three"])

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: Int64

In [9]:
df1 = pd.DataFrame(np.random.standard_normal((3, 4)), columns=["a", "b", "c", "d"])

df2 = pd.DataFrame(np.random.standard_normal((2, 3)), columns=["b", "d", "a"])

In [10]:
df1

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158

In [11]:
df2

          b         d         a
0 -1.660129 -0.671219  0.755499
1 -0.150297 -0.055102  1.500934

In [12]:
pd.concat([df1, df2])

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158
0  0.755499 -1.660129       NaN -0.671219
1  1.500934 -0.150297       NaN -0.055102

In [13]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.993656 -1.089930 -0.348214 -0.037440
1 -2.474380  3.115250  0.269315  1.030479
2  1.248545  0.347351  0.488464  1.407158
3  0.755499 -1.660129       NaN -0.671219
4  1.500934 -0.150297       NaN -0.055102

In [14]:
df1 = pd.DataFrame(
    {
        "a": [1.0, np.nan, 5.0, np.nan],
        "b": [np.nan, 2.0, np.nan, 6.0],
        "c": range(2, 18, 4),
    }
)

df2 = pd.DataFrame(
    {"a": [5.0, 4.0, np.nan, 3.0, 7.0], "b": [np.nan, 3.0, 4.0, 6.0, 8.0]}
)

In [15]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [16]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [17]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [18]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [19]:
data = pd.DataFrame(
    np.arange(6).reshape((2, 3)),
    index=pd.Index(["Ohio", "Colorado"], name="state"),
    columns=pd.Index(["one", "two", "three"], name="number"),
)
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [22]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [3]:
ser = pd.Series(
    np.random.uniform(size=9),
    index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"], [1, 2, 3, 1, 3, 1, 2, 2, 3]],
)
ser

a  1    0.597267
   2    0.549698
   3    0.278808
b  1    0.850715
   3    0.921770
c  1    0.550436
   2    0.224255
d  2    0.616101
   3    0.542508
dtype: float64

In [6]:
ser["b":"d"]

b  1    0.850715
   3    0.921770
c  1    0.550436
   2    0.224255
d  2    0.616101
   3    0.542508
dtype: float64

In [16]:
ser.loc[["b", "a"], 1]

b  1    0.850715
a  1    0.597267
dtype: float64

In [24]:
ser.loc[:,1]

a    0.597267
b    0.850715
c    0.550436
dtype: float64

In [29]:
unstacked_ser = ser.unstack()
unstacked_ser

          1         2         3
a  0.597267  0.549698  0.278808
b  0.850715       NaN  0.921770
c  0.550436  0.224255       NaN
d       NaN  0.616101  0.542508

In [31]:
stacked_ser = unstacked_ser.stack()
stacked_ser

a  1    0.597267
   2    0.549698
   3    0.278808
b  1    0.850715
   3    0.921770
c  1    0.550436
   2    0.224255
d  2    0.616101
   3    0.542508
dtype: float64

In [33]:
ser.index.nlevels

2

In [48]:
df = pd.DataFrame(
    [["bar", "one"], ["bar", "two"], ["foo", "one"], ["foo", "two"]],
    columns=["first", "second"],
)

In [49]:
df

  first second
0   bar    one
1   bar    two
2   foo    one
3   foo    two

In [50]:
pd.MultiIndex.from_frame(df)

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['first', 'second'])

In [53]:
ser

a  1    0.597267
   2    0.549698
   3    0.278808
b  1    0.850715
   3    0.921770
c  1    0.550436
   2    0.224255
d  2    0.616101
   3    0.542508
dtype: float64

In [56]:
ser[:-2]

a  1    0.597267
   2    0.549698
   3    0.278808
b  1    0.850715
   3    0.921770
c  1    0.550436
   2    0.224255
dtype: float64

In [58]:
s = pd.Series(
    [1, 2, 3, 4, 5, 6],
    index=pd.MultiIndex.from_product([["A", "B"], ["c", "d", "e"]]),
)
s

A  c    1
   d    2
   e    3
B  c    4
   d    5
   e    6
dtype: int64

In [61]:
def make_label(prefix, n):
    return ["%s%s" % (prefix, i) for i in range(n)]


miindex = pd.MultiIndex.from_product(
    [make_label("A", 4), make_label("B", 2), make_label("C", 4), make_label("D", 2)]
)
miindex

MultiIndex([('A0', 'B0', 'C0', 'D0'),
            ('A0', 'B0', 'C0', 'D1'),
            ('A0', 'B0', 'C1', 'D0'),
            ('A0', 'B0', 'C1', 'D1'),
            ('A0', 'B0', 'C2', 'D0'),
            ('A0', 'B0', 'C2', 'D1'),
            ('A0', 'B0', 'C3', 'D0'),
            ('A0', 'B0', 'C3', 'D1'),
            ('A0', 'B1', 'C0', 'D0'),
            ('A0', 'B1', 'C0', 'D1'),
            ('A0', 'B1', 'C1', 'D0'),
            ('A0', 'B1', 'C1', 'D1'),
            ('A0', 'B1', 'C2', 'D0'),
            ('A0', 'B1', 'C2', 'D1'),
            ('A0', 'B1', 'C3', 'D0'),
            ('A0', 'B1', 'C3', 'D1'),
            ('A1', 'B0', 'C0', 'D0'),
            ('A1', 'B0', 'C0', 'D1'),
            ('A1', 'B0', 'C1', 'D0'),
            ('A1', 'B0', 'C1', 'D1'),
            ('A1', 'B0', 'C2', 'D0'),
            ('A1', 'B0', 'C2', 'D1'),
            ('A1', 'B0', 'C3', 'D0'),
            ('A1', 'B0', 'C3', 'D1'),
            ('A1', 'B1', 'C0', 'D0'),
            ('A1', 'B1', 'C0', 'D1'),
            ('A1', 'B1', 'C1', 'D0'),
            ('A1', 'B1', 'C1', 'D1'),
            ('A1', 'B1', 'C2', 'D0'),
            ('A1', 'B1', 'C2', 'D1'),
            ('A1', 'B1', 'C3', 'D0'),
            ('A1', 'B1', 'C3', 'D1'),
            ('A2', 'B0', 'C0', 'D0'),
            ('A2', 'B0', 'C0', 'D1'),
            ('A2', 'B0', 'C1', 'D0'),
            ('A2', 'B0', 'C1', 'D1'),
            ('A2', 'B0', 'C2', 'D0'),
            ('A2', 'B0', 'C2', 'D1'),
            ('A2', 'B0', 'C3', 'D0'),
            ('A2', 'B0', 'C3', 'D1'),
            ('A2', 'B1', 'C0', 'D0'),
            ('A2', 'B1', 'C0', 'D1'),
            ('A2', 'B1', 'C1', 'D0'),
            ('A2', 'B1', 'C1', 'D1'),
            ('A2', 'B1', 'C2', 'D0'),
            ('A2', 'B1', 'C2', 'D1'),
            ('A2', 'B1', 'C3', 'D0'),
            ('A2', 'B1', 'C3', 'D1'),
            ('A3', 'B0', 'C0', 'D0'),
            ('A3', 'B0', 'C0', 'D1'),
            ('A3', 'B0', 'C1', 'D0'),
            ('A3', 'B0', 'C1', 'D1'),
            ('A3', 'B0', 'C2', 'D0'),
            ('A3', 'B0', 'C2', 'D1'),
            ('A3', 'B0', 'C3', 'D0'),
            ('A3', 'B0', 'C3', 'D1'),
            ('A3', 'B1', 'C0', 'D0'),
            ('A3', 'B1', 'C0', 'D1'),
            ('A3', 'B1', 'C1', 'D0'),
            ('A3', 'B1', 'C1', 'D1'),
            ('A3', 'B1', 'C2', 'D0'),
            ('A3', 'B1', 'C2', 'D1'),
            ('A3', 'B1', 'C3', 'D0'),
            ('A3', 'B1', 'C3', 'D1')],
           )

In [62]:
make_label("A", 4)

['A0', 'A1', 'A2', 'A3']

In [67]:
s3 = pd.Series(["X0", "X1", "X2", "X3"], index=["A", "B", "C", "D"])
s3

A    X0
B    X1
C    X2
D    X3
dtype: object

In [69]:
s3.to_frame().T

    A   B   C   D
0  X0  X1  X2  X3

In [5]:
left = pd.DataFrame({"key": [1], "v2": [10]})
left

   key  v2
0    1  10

In [6]:
right = pd.DataFrame({"key": [1, 2], "v1": [20, 30]})
right

   key  v1
0    1  20
1    2  30

In [7]:
# the join key is the 'key' column, it is the only column in the intersection of `left`
# and `right`.
pd.merge(left, right, how="outer")

   key    v2  v1
0    1  10.0  20
1    2   NaN  30

In [8]:
# changing v2 to v1
left = pd.DataFrame({"key": [1], "v1": [10]})
left

   key  v1
0    1  10

In [10]:
# the join key is now the 'key' and 'v1' columns together, both columns are in the
# intersection of the columns of `left` and `right`
pd.merge(left, right, how="outer")

   key  v1
0    1  10
1    1  20
2    2  30

#### merge_ordered()

In [11]:
left = pd.DataFrame(
    {"k": ["K0", "K1", "K1", "K2"], "lv": [1, 2, 3, 4], "s": ["a", "b", "c", "d"]}
)
left

    k  lv  s
0  K0   1  a
1  K1   2  b
2  K1   3  c
3  K2   4  d

In [13]:
right = pd.DataFrame({"k": ["K1", "K2", "K4"], "rv": [1, 2, 3]})
right

    k  rv
0  K1   1
1  K2   2
2  K4   3

In [15]:
pd.merge_ordered(left, right, left_by="s")

     k   lv  s   rv
0   K0  1.0  a  NaN
1   K1  NaN  a  1.0
2   K2  NaN  a  2.0
3   K4  NaN  a  3.0
4   K1  2.0  b  1.0
5   K2  NaN  b  2.0
6   K4  NaN  b  3.0
7   K1  3.0  c  1.0
8   K2  NaN  c  2.0
9   K4  NaN  c  3.0
10  K1  NaN  d  1.0
11  K2  4.0  d  2.0
12  K4  NaN  d  3.0

In [3]:
columns = pd.MultiIndex.from_tuples(
    [
        ("A", "cat"),
        ("B", "dog"),
        ("B", "cat"),
        ("A", "dog"),
    ],
    names=["exp", "animal"],
)
columns

MultiIndex([('A', 'cat'),
            ('B', 'dog'),
            ('B', 'cat'),
            ('A', 'dog')],
           names=['exp', 'animal'])

In [4]:
index = pd.MultiIndex.from_product(
    [("bar", "baz", "foo", "qux"), ("one", "two")], names=["first", "second"]
)
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [5]:
np.random.seed(0)
df = pd.DataFrame({'A(weekly)-2010': np.random.rand(3),
                   'A(weekly)-2011': np.random.rand(3),
                   'B(weekly)-2010': np.random.rand(3),
                   'B(weekly)-2011': np.random.rand(3),
                   'X' : np.random.randint(3, size=3)})
df['id'] = df.index
df

   A(weekly)-2010  A(weekly)-2011  B(weekly)-2010  B(weekly)-2011  X  id
0        0.548814        0.544883        0.437587        0.383442  0   0
1        0.715189        0.423655        0.891773        0.791725  1   1
2        0.602763        0.645894        0.963663        0.528895  1   2

In [8]:
new_df = pd.wide_to_long(df, ['A(weekly)', 'B(weekly)'], i='id',
                j='year', sep='-')
new_df

         X  A(weekly)  B(weekly)
id year
0  2010  0   0.548814   0.437587
1  2010  1   0.715189   0.891773
2  2010  1   0.602763   0.963663
0  2011  0   0.544883   0.383442
1  2011  1   0.423655   0.791725
2  2011  1   0.645894   0.528895

#### Combining reshaping with statistics

In [10]:
df = pd.DataFrame(np.random.randn(8, 4), index=index, columns=columns)
df

exp                  A         B                   A
animal             cat       dog       cat       dog
first second
bar   one    -0.211952 -0.080337  0.405398  0.118607
      two     1.254414  1.419102 -0.743856 -2.517437
baz   one    -1.507096  1.149076 -1.193578  1.141042
      two     1.509445  1.067775 -0.686589  0.014873
foo   one    -0.375666 -0.038224  0.367974 -0.044724
      two    -0.302375 -2.224404  0.724006  0.359003
qux   one     1.076121  0.192141  0.852926  0.018357
      two     0.428304  0.996278 -0.491150  0.712678

In [15]:
df.stack()#.mean(1)#.unstack()

exp                         A         B
first second animal
bar   one    cat    -0.211952  0.405398
             dog     0.118607 -0.080337
      two    cat     1.254414 -0.743856
             dog    -2.517437  1.419102
baz   one    cat    -1.507096 -1.193578
             dog     1.141042  1.149076
      two    cat     1.509445 -0.686589
             dog     0.014873  1.067775
foo   one    cat    -0.375666  0.367974
             dog    -0.044724 -0.038224
      two    cat    -0.302375  0.724006
             dog     0.359003 -2.224404
qux   one    cat     1.076121  0.852926
             dog     0.018357  0.192141
      two    cat     0.428304 -0.491150
             dog     0.712678  0.996278

In [16]:
df.stack().mean(1)#.unstack()

first  second  animal
bar    one     cat       0.096723
               dog       0.019135
       two     cat       0.255279
               dog      -0.549168
baz    one     cat      -1.350337
               dog       1.145059
       two     cat       0.411428
               dog       0.541324
foo    one     cat      -0.003846
               dog      -0.041474
       two     cat       0.210816
               dog      -0.932700
qux    one     cat       0.964523
               dog       0.105249
       two     cat      -0.031423
               dog       0.854478
dtype: float64

In [17]:
df.stack().mean(1).unstack()

animal             cat       dog
first second
bar   one     0.096723  0.019135
      two     0.255279 -0.549168
baz   one    -1.350337  1.145059
      two     0.411428  0.541324
foo   one    -0.003846 -0.041474
      two     0.210816 -0.932700
qux   one     0.964523  0.105249
      two    -0.031423  0.854478

In [20]:
# same result another way
df.groupby(level=1, axis=1).mean()

animal             cat       dog
first second
bar   one     0.096723  0.019135
      two     0.255279 -0.549168
baz   one    -1.350337  1.145059
      two     0.411428  0.541324
foo   one    -0.003846 -0.041474
      two     0.210816 -0.932700
qux   one     0.964523  0.105249
      two    -0.031423  0.854478

#### `align()`

In [2]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

s1 = s[:4]

s2 = s[1:]

In [3]:
s1

a    0.081873
b    1.012622
c    0.331183
d    1.134811
dtype: float64

In [4]:
s2

b    1.012622
c    0.331183
d    1.134811
e   -2.557242
dtype: float64

In [5]:
s1.align(s2)

(a    0.081873
 b    1.012622
 c    0.331183
 d    1.134811
 e         NaN
 dtype: float64,
 a         NaN
 b    1.012622
 c    0.331183
 d    1.134811
 e   -2.557242
 dtype: float64)

In [4]:
s = pd.Series(np.random.randn(8), index=list('abcdefgh'))
s

a   -0.036235
b    0.403947
c   -0.589238
d    0.169781
e    0.567891
f   -0.428895
g    0.184885
h    0.131586
dtype: float64

In [5]:
s[:5]

a   -0.036235
b    0.403947
c   -0.589238
d    0.169781
e    0.567891
dtype: float64

In [13]:
s[::2]

a   -0.036235
c   -0.589238
e    0.567891
g    0.184885
dtype: float64

In [16]:
df1 = pd.DataFrame(
    np.random.randn(6, 4),
    index=list('abcdef'),
    columns=list('ABCD')
)

df1

          A         B         C         D
a  1.878398  1.264462  0.516860 -0.067432
b -1.347321 -0.273450  0.343030  0.453402
c -0.357705 -1.694392  1.144507  0.980726
d  1.415230 -1.733632 -0.337080 -1.024201
e -0.505439 -0.806762 -1.295417 -1.395265
f -0.546966 -0.918051  0.149953  0.510591

In [17]:
df1.loc[['a', 'b', 'd']]

          A         B        C         D
a  1.878398  1.264462  0.51686 -0.067432
b -1.347321 -0.273450  0.34303  0.453402
d  1.415230 -1.733632 -0.33708 -1.024201

In [18]:
df1.loc[['a', 'b', 'd'], :]

          A         B        C         D
a  1.878398  1.264462  0.51686 -0.067432
b -1.347321 -0.273450  0.34303  0.453402
d  1.415230 -1.733632 -0.33708 -1.024201

In [19]:
df2 = pd.DataFrame(
    {'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
     'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
     'c': np.random.randn(7)}
)
df2

       a  b         c
0    one  x  0.335981
1    one  y -1.015141
2    two  y  1.810929
3  three  x  0.793801
4    two  y -1.182880
5    one  x -0.595793
6    six  x -1.515476

In [20]:
[x.startswith('t') for x in df2['a']]

[False, False, True, True, True, False, False]

In [ ]:
df2[[x.startswith('t') for x in df2['a']]]

#### `query()`

In [5]:
df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
                   'c': np.random.randint(5, size=12),
                   'd': np.random.randint(9, size=12)})
df

    a  b  c  d
0   a  a  1  2
1   a  a  4  5
2   b  a  4  0
3   b  a  0  0
4   c  b  2  6
5   c  b  4  2
6   d  b  2  1
7   d  b  3  8
8   e  c  1  3
9   e  c  0  3
10  f  c  0  0
11  f  c  4  0

In [6]:
df.query('c == [1, 2]')

   a  b  c  d
0  a  a  1  2
4  c  b  2  6
6  d  b  2  1
8  e  c  1  3

In [7]:
df.query('[1, 2] in c')

   a  b  c  d
0  a  a  1  2
4  c  b  2  6
6  d  b  2  1
8  e  c  1  3

In [8]:
df.query('c in [1, 2]')

   a  b  c  d
0  a  a  1  2
4  c  b  2  6
6  d  b  2  1
8  e  c  1  3

In [9]:
df[df['c'].isin([1, 2])]

   a  b  c  d
0  a  a  1  2
4  c  b  2  6
6  d  b  2  1
8  e  c  1  3

In [13]:
df.query('b in ["a", "b"]')

   a  b  c  d
0  a  a  1  2
1  a  a  4  5
2  b  a  4  0
3  b  a  0  0
4  c  b  2  6
5  c  b  4  2
6  d  b  2  1
7  d  b  3  8

In [14]:
df.query('b == ["a", "b"]')

   a  b  c  d
0  a  a  1  2
1  a  a  4  5
2  b  a  4  0
3  b  a  0  0
4  c  b  2  6
5  c  b  4  2
6  d  b  2  1
7  d  b  3  8

In [15]:
df = pd.DataFrame({'col': ["A", "A", "B", "B"],
                   'A': [80, 23, np.nan, 22],
                   'B': [80, 55, 76, 67]})
df

  col     A   B
0   A  80.0  80
1   A  23.0  55
2   B   NaN  76
3   B  22.0  67

In [19]:
codes, unique_vals_in_col = pd.factorize(df['col'])

In [21]:
codes

array([0, 0, 1, 1], dtype=int64)

In [22]:
unique_vals_in_col

Index(['A', 'B'], dtype='object')

In [2]:
s = pd.Series(
    [1, 2, 3, 4, 5, 6],
    index=pd.MultiIndex.from_product([["A", "B"], ["c", "d", "e"]]),
)
s

A  c    1
   d    2
   e    3
B  c    4
   d    5
   e    6
dtype: int64

In [3]:
s.loc[[("A", "c"), ("B", "d")]]  # list of tuples

A  c    1
B  d    5
dtype: int64

In [4]:
s.loc[(["A", "B"], ["c", "d"])]  # tuple of lists

A  c    1
   d    2
B  c    4
   d    5
dtype: int64

In [9]:
midx = pd.MultiIndex(
    levels=[["zero", "one"], ["x", "y"]], codes=[[1, 1, 1, 0], [1, 0, 1, 0]]
)
midx

MultiIndex([( 'one', 'y'),
            ( 'one', 'x'),
            ( 'one', 'y'),
            ('zero', 'x')],
           )

In [12]:
midx.levels[1]

Index(['x', 'y'], dtype='object')

In [13]:
midx = pd.MultiIndex(
    levels=[["zero", "one"], ["x", "y"]], codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)

df = pd.DataFrame(np.random.randn(4, 2), index=midx)
df

               0         1
one  y -0.517481 -0.645921
     x -0.786436  0.020174
zero y  2.188109 -1.122532
     x -0.863560 -0.322254

In [17]:
df2 = df.groupby(level=0).mean()
df2

             0         1
one  -0.651958 -0.312873
zero  0.662274 -0.722393

In [20]:
df2.reindex(df.index, level=0)

               0         1
one  y -0.651958 -0.312873
     x -0.651958 -0.312873
zero y  0.662274 -0.722393
     x  0.662274 -0.722393

In [21]:
# aligning
df_aligned, df2_aligned = df.align(df2, level=0)

In [22]:
df_aligned

               0         1
one  y -0.517481 -0.645921
     x -0.786436  0.020174
zero y  2.188109 -1.122532
     x -0.863560 -0.322254

In [23]:
df2_aligned

               0         1
one  y -0.651958 -0.312873
     x -0.651958 -0.312873
zero y  0.662274 -0.722393
     x  0.662274 -0.722393

In [27]:
c = pd.cut(range(4), bins=2)
type(c)

pandas.core.arrays.categorical.Categorical

In [28]:
pd.interval_range(start=pd.Timestamp("2017-01-01"), periods=4)

IntervalIndex([(2017-01-01, 2017-01-02], (2017-01-02, 2017-01-03], (2017-01-03, 2017-01-04], (2017-01-04, 2017-01-05]], dtype='interval[datetime64[ns], right]')

In [29]:
pd.interval_range(start=pd.Timestamp("2017-01-01"), periods=2)

IntervalIndex([(2017-01-01, 2017-01-02], (2017-01-02, 2017-01-03]], dtype='interval[datetime64[ns], right]')

##### integer indexing problems

In [ ]:
s = pd.Series(range(5), index=list('abcde'))

In [38]:
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [39]:
# works fine because integers are not used as index labels
s[-1]

4

In [4]:
s = pd.Series(range(5))

In [41]:
# errors because now integers are index labels and the label -1 is not found in the
# index
s[-1]

KeyError: -1

In [12]:
s = pd.Series(range(5), name='row_to_append', index=list('abcde'))
s

a    0
b    1
c    2
d    3
e    4
Name: row_to_append, dtype: int64

In [13]:
s.to_frame().T

               a  b  c  d  e
row_to_append  0  1  2  3  4

In [15]:
s2 = pd.Series(["X0", "X1", "X2", "X3"], index=["A", "B", "C", "D"])
s2

A    X0
B    X1
C    X2
D    X3
dtype: object

In [16]:
s2.to_frame().T

    A   B   C   D
0  X0  X1  X2  X3

In [2]:
ser = pd.Series(
    ["a", "b", "c", "d", "e", "f"],
    index=pd.MultiIndex.from_arrays(
        [["A", "B", "C"] * 2, [1, 2, 3, 4, 5, 6]], names=["Let", "Num"]
    ),
)

In [4]:
ser.reset_index()

  Let  Num  0
0   A    1  a
1   B    2  b
2   C    3  c
3   A    4  d
4   B    5  e
5   C    6  f

#### `merge()` vs `merge_ordered()`

In [4]:
df1 = pd.DataFrame(
    {
        "key": ["a", "c", "e", "a", "c", "e"],
        "lvalue": [1, 2, 3, 1, 2, 3],
        "group": ["a", "a", "a", "b", "b", "b"]
    }
)
df1

  key  lvalue group
0   a       1     a
1   c       2     a
2   e       3     a
3   a       1     b
4   c       2     b
5   e       3     b

In [5]:
df2 = pd.DataFrame({"key": ["b", "c", "d"], "rvalue": [1, 2, 3]})
df2

  key  rvalue
0   b       1
1   c       2
2   d       3

In [10]:
pd.merge_ordered(df1, df2, left_by="group")

  key  lvalue group  rvalue
0   a     1.0     a     NaN
1   b     NaN     a     1.0
2   c     2.0     a     2.0
3   d     NaN     a     3.0
4   e     3.0     a     NaN
5   a     1.0     b     NaN
6   b     NaN     b     1.0
7   c     2.0     b     2.0
8   d     NaN     b     3.0
9   e     3.0     b     NaN

In [11]:
pd.merge(df1, df2, how="outer")

  key  lvalue group  rvalue
0   a     1.0     a     NaN
1   a     1.0     b     NaN
2   c     2.0     a     2.0
3   c     2.0     b     2.0
4   e     3.0     a     NaN
5   e     3.0     b     NaN
6   b     NaN   NaN     1.0
7   d     NaN   NaN     3.0

In [12]:
left = pd.DataFrame(
    {"k": ["K0", "K1", "K1", "K2"], "lv": [1, 2, 3, 4], "s": ["a", "b", "c", "d"]}
)


right = pd.DataFrame({"k": ["K1", "K2", "K4"], "rv": [1, 2, 3]})

In [19]:
print(left)

    k  lv  s
0  K0   1  a
1  K1   2  b
2  K1   3  c
3  K2   4  d

In [18]:
print(right)

    k  rv
0  K1   1
1  K2   2
2  K4   3

In [16]:
print(pd.merge_ordered(left, right, left_by="s"))

     k   lv  s   rv
0   K0  1.0  a  NaN
1   K1  NaN  a  1.0
2   K2  NaN  a  2.0
3   K4  NaN  a  3.0
4   K1  2.0  b  1.0
5   K2  NaN  b  2.0
6   K4  NaN  b  3.0
7   K1  3.0  c  1.0
8   K2  NaN  c  2.0
9   K4  NaN  c  3.0
10  K1  NaN  d  1.0
11  K2  4.0  d  2.0
12  K4  NaN  d  3.0

In [2]:
columns = pd.MultiIndex.from_tuples(
    [
        ("A", "cat"),
        ("B", "dog"),
        ("B", "cat"),
        ("A", "dog"),
    ],
    names=["exp", "animal"],
)

index = pd.MultiIndex.from_product(
    [("bar", "baz", "foo", "qux"), ("one", "two")], names=["first", "second"]
)

df = pd.DataFrame(np.random.randn(8, 4), index=index, columns=columns)
df

exp                  A         B                   A
animal             cat       dog       cat       dog
first second
bar   one     2.077603  0.361792 -0.375709  1.092886
      two    -2.127937 -1.290040  0.520077  0.502697
baz   one    -1.153623 -0.186975 -1.364843 -0.073642
      two    -0.666047 -1.000229 -0.628537  0.365285
foo   one     0.692408  0.303215 -0.660769  0.907828
      two     0.646229 -0.179817  2.333660 -1.242967
qux   one    -0.948275 -1.116857  0.328187  0.959408
      two     0.860711  1.342254  1.873710 -0.821765

In [3]:
df.columns

MultiIndex([('A', 'cat'),
            ('B', 'dog'),
            ('B', 'cat'),
            ('A', 'dog')],
           names=['exp', 'animal'])

In [4]:
df_stack = df.stack()
df_stack

exp                         A         B
first second animal
bar   one    cat     2.077603 -0.375709
             dog     1.092886  0.361792
      two    cat    -2.127937  0.520077
             dog     0.502697 -1.290040
baz   one    cat    -1.153623 -1.364843
             dog    -0.073642 -0.186975
      two    cat    -0.666047 -0.628537
             dog     0.365285 -1.000229
foo   one    cat     0.692408 -0.660769
             dog     0.907828  0.303215
      two    cat     0.646229  2.333660
             dog    -1.242967 -0.179817
qux   one    cat    -0.948275  0.328187
             dog     0.959408 -1.116857
      two    cat     0.860711  1.873710
             dog    -0.821765  1.342254

In [5]:
df_stack_mean = df_stack.mean(1)
df_stack_mean

first  second  animal
bar    one     cat       0.850947
               dog       0.727339
       two     cat      -0.803930
               dog      -0.393671
baz    one     cat      -1.259233
               dog      -0.130308
       two     cat      -0.647292
               dog      -0.317472
foo    one     cat       0.015819
               dog       0.605522
       two     cat       1.489944
               dog      -0.711392
qux    one     cat      -0.310044
               dog      -0.078725
       two     cat       1.367211
               dog       0.260245
dtype: float64

In [6]:
type(df_stack_mean)

pandas.core.series.Series

In [8]:
df_stack_mean_unstack = df_stack_mean.unstack()
df_stack_mean_unstack

animal             cat       dog
first second
bar   one     0.850947  0.727339
      two    -0.803930 -0.393671
baz   one    -1.259233 -0.130308
      two    -0.647292 -0.317472
foo   one     0.015819  0.605522
      two     1.489944 -0.711392
qux   one    -0.310044 -0.078725
      two     1.367211  0.260245

In [9]:
# the above three transformations as one expression:
df.stack().mean(1).unstack()

animal             cat       dog
first second
bar   one     0.850947  0.727339
      two    -0.803930 -0.393671
baz   one    -1.259233 -0.130308
      two    -0.647292 -0.317472
foo   one     0.015819  0.605522
      two     1.489944 -0.711392
qux   one    -0.310044 -0.078725
      two     1.367211  0.260245

In [35]:
df.stack().groupby(level=1).mean()

exp            A         B
second
one     0.444324 -0.338995
two    -0.310474  0.371385

In [38]:
df.mean().unstack(0)

exp            A         B
animal
cat    -0.077366  0.253222
dog     0.211216 -0.220832

#### Pivot tables

In [39]:
import datetime

In [47]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 6,
        "B": ["A", "B", "C"] * 8,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 4,
        "D": np.random.randn(24),
        "E": np.random.randn(24),
        "F": [datetime.datetime(2013, i, 1) for i in range(1, 13)]
        + [datetime.datetime(2013, i, 15) for i in range(1, 13)],
    }
)

In [66]:
df.loc[(df['A'] == 'one') & (df['B'] == 'A') & (df['C'] == 'foo')]

      A  B    C         D         E          F
0   one  A  foo  1.502498 -1.108318 2013-01-01
12  one  A  foo -0.590705 -0.252875 2013-01-15

In [59]:
pd.pivot_table(df, values="D", index=["B"], columns=["A", "C"])

A       one               three                two
C       bar       foo       bar       foo      bar       foo
B
A  0.340813  0.455897 -0.252335       NaN      NaN -0.960108
B -0.102625 -0.241637       NaN  1.107117  1.48377       NaN
C  0.366627  0.608744 -1.115474       NaN      NaN  0.760677

In [2]:
ages = np.array([10, 15, 28, 62])

pd.cut(ages, bins=3)

[(9.948, 27.333], (9.948, 27.333], (27.333, 44.667], (44.667, 62.0]]
Categories (3, interval[float64, right]): [(9.948, 27.333] < (27.333, 44.667] < (44.667, 62.0]]

In [3]:
pd.cut(ages, bins=[0,12,18,65])

[(0, 12], (12, 18], (18, 65], (18, 65]]
Categories (3, interval[int64, right]): [(0, 12] < (12, 18] < (18, 65]]

In [5]:
df = pd.DataFrame({"key": list("bbacab"), "data1": range(6)})
print(df)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [6]:
df = pd.DataFrame({"A": ["a", "b", "a"], "B": ["c", "c", "b"], "C": [1, 2, 3]})
df

   A  B  C
0  a  c  1
1  b  c  2
2  a  b  3

In [7]:
pd.get_dummies(df)

   C  A_a  A_b  B_b  B_c
0  1    1    0    0    1
1  2    0    1    0    1
2  3    1    0    1    0

In [27]:
np.random.seed([3, 1415])

n = 20

cols = np.array(["key", "row", "item", "col"])

df = cols + pd.DataFrame(
    (np.random.randint(5, size=(n, 4)) // [2, 1, 2, 1]).astype(str)
)


df.columns = cols

df = df.join(pd.DataFrame(np.random.rand(n, 2).round(2)).add_prefix("val"))

df.head(5)

    key   row   item   col  val0  val1
0  key0  row3  item1  col3  0.81  0.04
1  key1  row2  item1  col2  0.44  0.07
2  key1  row0  item1  col0  0.77  0.01
3  key0  row4  item0  col2  0.15  0.59
4  key1  row0  item2  col1  0.81  0.64

In [30]:
pd.pivot_table(df, index='row', columns='col', values='val0', aggfunc='mean', fill_value=0)

col   col0   col1   col2   col3  col4
row
row0  0.77  0.605  0.000  0.860  0.65
row2  0.13  0.000  0.395  0.500  0.25
row3  0.00  0.310  0.000  0.545  0.00
row4  0.00  0.100  0.395  0.760  0.24

In [32]:
pd.crosstab(df["row"], df["col"])

col   col0  col1  col2  col3  col4
row
row0     1     2     0     1     1
row2     1     0     2     1     2
row3     0     1     0     2     0
row4     0     1     2     2     1

In [2]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [3]:
age_categories = pd.cut(ages, bins, labels=group_names)

In [9]:
age_categories

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [10]:
age_categories.categories

Index(['Youth', 'YoungAdult', 'MiddleAged', 'Senior'], dtype='object')

In [11]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data

            0         1         2         3
0   -0.259882  0.040893 -0.257065 -1.359628
1    1.417552  0.735563  1.592745 -0.901152
2   -1.198632 -1.121090  0.104543  0.975820
3   -1.593808  1.985960  0.460374  0.453101
4   -0.259666 -1.700241  0.141748 -0.044591
..        ...       ...       ...       ...
995 -2.164861  1.803409  0.438629 -0.125951
996 -0.706488 -1.192654  0.397425 -1.012085
997 -1.222656  0.109204  1.171499  1.018065
998 -1.082868 -0.588172 -0.286621 -2.351804
999 -0.158073  0.199581  0.596221 -0.892227

[1000 rows x 4 columns]

In [13]:
(data.abs() > 3).any(axis="columns").value_counts()

False    994
True       6
dtype: int64

In [14]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
33   3.449139 -1.005077 -0.316415 -0.218686
116 -3.583593 -0.083265 -0.499641 -1.173323
162  0.909549  3.112861  0.670949  0.278720
649 -1.666146  1.508614  2.073068 -3.271708
880 -3.100553 -0.997928 -0.314972  1.021513
947 -0.732529 -3.052124 -1.084024  0.810658

In [3]:
fruits = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2, dtype='category')

In [12]:
fruits

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: category
Categories (2, object): ['apple', 'orange']

In [11]:
type(fruits.array)

pandas.core.arrays.categorical.Categorical

In [9]:
type(fruits.array.categories)

pandas.core.indexes.base.Index

In [10]:
type(fruits.array.codes)

numpy.ndarray

In [14]:
dict(enumerate(fruits.array.categories))

{0: 'apple', 1: 'orange'}

In [23]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)

bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
type(bins)

pandas.core.arrays.categorical.Categorical

In [24]:
type(draws)

numpy.ndarray

In [25]:
bins = pd.Series(bins, name='quartile')

In [26]:
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [27]:
ser = pd.Series([390., 350., 30., 20.],
                index=['Falcon', 'Falcon', 'Parrot', 'Parrot'], name="Max Speed")

In [28]:
ser

Falcon    390.0
Falcon    350.0
Parrot     30.0
Parrot     20.0
Name: Max Speed, dtype: float64

In [29]:
ser > 100

Falcon     True
Falcon     True
Parrot    False
Parrot    False
Name: Max Speed, dtype: bool

## chapter 8 for sure

In [2]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
    columns=[["Ohio", "Ohio", "Colorado"],["Green", "Red", "Green"]]
)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [7]:
frame.index.levels[0]

Index(['a', 'b'], dtype='object')

In [9]:
frame.columns.nlevels

2

In [10]:
frame["Ohio"]

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [12]:
frame.loc["a"]

   Ohio     Colorado
  Green Red    Green
1     0   1        2
2     3   4        5